# 位置翻译字典
POSITION_TRANSLATION = {"Guard": "后卫", "Forward": "前锋", "Center": "中锋"}

# 固定首发位置
FIXED_POSITIONS = ["PG", "SG", "SF", "PF", "C"]

# 位置全称映射
POSITION_FULL_NAMES = {
    "PG": "控球后卫",
    "SG": "得分后卫",
    "SF": "小前锋",
    "PF": "大前锋",
    "C": "中锋"
}

# 位置适配规则
POSITION_ADAPTATION_RULES = {
    "仅含后卫": ["PG", "SG"],
    "后卫+前锋": ["SG", "SF"],
    "仅含前锋": ["SF", "PF"],
    "前锋+中锋": ["PF", "C"],
    "仅含中锋": ["C"]
}

# 球队名称翻译字典
TEAM_TRANSLATION = {
    "Kings": "国王",
    "Rockets": "火箭",
    "Heat": "热火",
    "Raptors": "猛龙",
    "Grizzlies": "灰熊",
    "Hawks": "老鹰",
    "Suns": "太阳",
    "Cavaliers": "骑士",
    "Pelicans": "鹈鹕",
    "Jazz": "爵士",
    "Bucks": "雄鹿",
    "Knicks": "尼克斯",
    "Trail Blazers": "开拓者",
    "Lakers": "湖人",
    "Wizards": "奇才",
    "Spurs": "马刺",
    "Hornets": "黄蜂",
    "Magic": "魔术",
    "76ers": "76人",
    "Celtics": "凯尔特人",
    "Pacers": "步行者",
    "Nuggets": "掘金",
    "Bulls": "公牛",
    "Thunder": "雷霆",
    "Nets": "篮网",
    "Timberwolves": "森林狼",
    "Warriors": "勇士",
    "Pistons": "活塞",
    "Mavericks": "独行侠",
    "Clippers": "快船",
}

# 球队ID映射
TEAM_ID_MAP = {
    "勇士": "1610612744",
    "湖人": "1610612747",
    "凯尔特人": "1610612738",
    "篮网": "1610612751",
    "雄鹿": "1610612749",
    "掘金": "1610612743",
    "热火": "1610612748",
    "76人": "1610612750",
    "独行侠": "1610612742",
    "快船": "1610612746",
    "爵士": "1610612762",
    "猛龙": "1610612761",
    "开拓者": "1610612757",
    "太阳": "1610612756",
    "步行者": "1610612754",
    "活塞": "1610612765",
    "骑士": "1610612739",
    "尼克斯": "1610612752",
    "国王": "1610612758",
    "森林狼": "1610612759",
    "黄蜂": "1610612764",
    "老鹰": "1610612737",
    "奇才": "1610612764",
    "魔术": "1610612753",
    "雷霆": "1610612760",
    "火箭": "1610612745",
    "灰熊": "1610612763",
    "鹈鹕": "1610612740",
    "马刺": "1610612755",
}

# 薪资上限
SALARY_LIMIT = 187895000
